In [1]:
import pandas as pd
df = pd.read_csv('adult.data.csv')

##### How many of each race are represented in this dataset? This should be a Pandas series with race names as the index labels.

In [2]:
df.head(2)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 15 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   age             32561 non-null  int64
 1   workclass       32561 non-null  object
 2   fnlwgt          32561 non-null  int64
 3   education       32561 non-null  object
 4   education-num   32561 non-null  int64
 5   marital-status  32561 non-null  object
 6   occupation      32561 non-null  object
 7   relationship    32561 non-null  object
 8   race            32561 non-null  object
 9   sex             32561 non-null  object
 10  capital-gain    32561 non-null  int64
 11  capital-loss    32561 non-null  int64
 12  hours-per-week  32561 non-null  int64
 13  native-country  32561 non-null  object
 14  salary          32561 non-null  object
dtypes: int64(6), object(9)
memory usage: 3.7+ MB

In [4]:
race_count = df['race'].value_counts()
race_count

White                 27816
Black                  3124
Asian-Pac-Islander     1039
Amer-Indian-Eskimo      311
Other                   271
Name: race, dtype: int64

**What is the average age of men?**

In [5]:
average_age_men = df[df.sex == 'Male'].age.mean()
average_age_men

39.43354749885268

**What is the percentage of people who have a Bachelor's degree?**

In [6]:
percentage_bachelors = (df.education == 'Bachelors').mean() * 100
percentage_bachelors.round(1)

16.4

**What percentage of people with advanced education (`Bachelors`, `Masters`, or `Doctorate`) make more than 50K?**
**What percentage of people without advanced education make more than 50K?**

with and without `Bachelors`, `Masters`, or `Doctorate`

In [12]:
higher_education = df[ df['education'].isin(['Bachelors', 'Masters', 'Doctorate']) ]
higher_education.head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [13]:
lower_education = df[ ~ df['education'].isin(['Bachelors', 'Masters', 'Doctorate']) ]
lower_education.head(3)

,age,workclass,fnlwgt,education,education-num,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,salary
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
6,49,Private,160187,9th,5,Married-spouse-absent,Other-service,Not-in-family,Black,Female,0,0,16,Jamaica,<=50K

##### percentage with salary >50K

In [49]:
higher_education_rich = (higher_education['salary'].value_counts()[1] / higher_education['salary'].count()) *100
higher_education_rich.round(1)

46.5

In [48]:
lower_education_rich = (lower_education['salary'].value_counts()[1] / lower_education['salary'].count()) *100
lower_education_rich.round(1)

17.4

##### What is the minimum number of hours a person works per week (hours-per-week feature)?

In [45]:
min_work_hours = df['hours-per-week'].min()
min_work_hours

1

##### What percentage of the people who work the minimum number of hours per week have a salary of >50K?

In [56]:
num_min_workers = len(df[df['hours-per-week'] == min_work_hours])
num_min_workers
rich_percentage = len(df[(df['hours-per-week'] == min_work_hours) & (df['salary'] == '>50K')]) / num_min_workers * 100
rich_percentage

10.0

##### What country has the highest percentage of people that earn >50K?

In [86]:
rich_df = df[df.salary == '>50K']
rich_country = rich_df.groupby('native-country')[('native-country')].count()
total_country = df.groupby('native-country')[('native-country')].count()

highest_earning_country = ((rich_country / total_country) * 100).idxmax() 
highest_earning_country_percentage =  ((rich_country / total_country) * 100).max()

In [87]:
highest_earning_country

'Iran'

##### Identify the most popular occupation for those who earn >50K in India.

In [124]:
top_IN_occupation = df[df['native-country'] == "India"].query('salary == ">50K"').occupation.value_counts().idxmax()
top_IN_occupation

'Prof-specialty'